app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "microposts".* FROM "microposts" WHERE "microposts"."user_id" = ? ORDER BY "microposts"."id" ASC LIMIT ? OFFSET ?  [["user_id", 1], ["LIMIT", 1], ["OFFSET", 1]]
SELECT "users".* FROM "users"
---
  def show
    @user = User.find(params[:id])
    @micropost = @user.microposts.all